{
    "specifications": {
        "ministry": "Auswärtiges Amt",
        "emails": {
            "datenschutzbeauftragter": "Gast@opendataprocess.onmicrosoft.com",
            "pressereferat": "Gast@opendataprocess.onmicrosoft.com"
        }
    },
    "fields": {
        "responsible": {
            "label": "Person responsible",
            "type": "textfield",
            "info": ""
        }
    },
    "modules": {
        "describe-dataset": {
            "name": "Datensatz beschreiben",
            "description": "Zum Start einer neuen Bereitstellung geben Sie dem Datensatz einen treffenden Titel und eine beschreiben Sie den Inhalt in kurzen und prägnant. Laden Sie im nächsten Schritt die einzelnen Dateien, die zum Datensatz gehören, hoch und beschreiben diese.",
            "fields": {
                "title": {
                    "label": "Titel",
                    "type": "textfield",
                    "placeholder": "z. B. Protokolldaten 2020",
                    "info": "Bitte geben Sie hier den Titel des Datensatzes ein. Dieser sollte eindeutig sein und klar auf den Inhalt hinweisen.",
                    "mandatory": true
                },
                "description": {
                    "label": "Beschreibung",
                    "type": "multitextfield",
                    "placeholder": "Beschreiben Sie kurz den Inhalt des Datensatzes.",
                    "info": "Bitte beschreiben Sie in diesem Feld den Inhalt des Datensatz möglichst prägnant.",
                    "mandatory": true
                },
                "data-provider": {
                    "label": "Datenbereitsteller",
                    "type": "textfield",
                    "prefill": "$specifications.ministry",
                    "info": "Dieses Feld dürfte mit dem Namen des übergeordneten Ministeriums vorausgefüllt sein und ist somit nicht änderbar. Dieses hängt mit der Vergabe des GovData-Zugangs zusammen.",
                    "mandatory": true
                },
                "categories": {
                    "label": "Kategorien",
                    "type": "multi-select-checkboxes",
                    "options": [
                        "Bevölkerung und Gesellschaft", "Bildung, Kultur und Sport", "Energie", "Gesundheit",
                        "Internationale Themen", "Verkehr", "Landwirtschaft, Fischerei, Forstwirtschaft & Nahrungsmittel",
                        "Regierung und öffentlicher Sektor", "Regionen und Städte", "Umwelt", "Wissenschaft und Technologie",
                        "Wirtschaft und Finanzen", "Justiz, Rechtssystem und öffentliche Sicherheit"
                    ],
                    "info": "Wählen Sie hier bitte eine oder mehrere Kategorien aus, die dem Inhalt Ihres Datensatzes am nächsten kommen. Handelt es sich um bspw. Daten der Gesundheitsfürsorge in Deutschland wählen Sie bitte die Kategorie „Gesundheit“."
                },
                "tags": {
                    "label": "Schlagwörter",
                    "type": "tag-creator",
                    "placeholder": "Mit welchen Wörter würde man nach dem Datensatz suchen?",
                    "info": "Hier sollten Schlagworte, Schlüsselbegriffe oder synonyme Begriffe gepflegt werden. Eine gewissenhafte Verschlagwortung ermöglicht es Nutzern Daten schneller und gezielter zu finden. Nutzen Sie Schlagwörter, um den Inhalt des bereitgestellten Datensatzes möglichst genau zu beschreiben. Dabei ist es empfehlenswert, auch den Titel der Ressource (bzw. die charakteristischen Bestandteile daraus) zusätzlich als Schlüsselwort zu erfassen.<br><br>Synonyme sollten ebenfalls als Schlagwort hinterlegt sein, um die bereitgestellten Daten einem möglichst großen Publikum zugänglich zu machen.<br><br>Beispiele:<br>1. Für Kindertagesstätte wären als Schlagworte denkbar: Kita, Hort, Kinderladen, Kinderhort uvm.<br>2. Eine Suche wird nach allgemeinen Verkehrsdaten gestartet mit dem Oberbegriff „Verkehr“. Ohne eine entsprechende Verschlagwortung könnten hier die Ergebnisse nicht eindeutig oder unvollständig ausfallen."
                }
            }
        },
        "data-upload": {
            "name": "Dateien hochladen",
            "description": "Sie haben den Datensatz in Schritt 1 beschrieben. Auf dieser Seite können Sie nun die dazugehörigen einzelnen Dateien hochladen und nähere Informationen dazu angeben. Die an dieser stelle hochgeladenen Daten werden nur intern in SharePoint gespeichert. Sie sind nicht öffentlich einsehbar und werden einer erneuten Prüfung unterzogen.",
            "fields": {
                "uploader": {
                    "label": "Hochladen der einzelnen Ressourcen (Daten)",
                    "type": "upload-files",
                    "placeholder": "Ziehen Sie die Daten einfach von Ihrem Rechner in dieses Feld oder klicken Sie auf den Button:",
                    "info": "Ziehen Sie die Daten von ihrem Desktop einfach per Drag & Drop in dieses Feld um die Daten hochzuladen.<br>Folgende Formate sind zurzeit für Open Data am besten geeignet:<br>• XML, RDF, CSV, JSON, RDF, HTML<br>Bitte exportieren sie die Datei nach Möglichkeit in eins oder mehrere dieser Dateiformaten und fügen Sie diese Dateien dem Upload hinzu.",
                    "mandatory": true
                }
            }
        },
        "prepare-data": {
            "name": "Prepare Data",
            "description": "Check if the data meets the standards for open publication, e.g. spell out internal abbreviations",
            "fields": {
                "preparedness": {
                    "label": "Is the data prepared?",
                    "type": "checkbox",
                    "info": ""
                }
            }
        },
        "publish-data": {
            "name": "Publish Data",
            "description": "The data needs to be permanently and publicly accessible via an URL",
            "fields": {
                "ref": "responsible",
                "url": {
                    "label": "URL to published data",
                    "type": "textfield",
                    "info": ""
                },
                "url-accessibility": {
                    "label": "Is the URL publicly accessible?",
                    "type": "checkbox",
                    "info": "If unsure, see if you can download it when opening the URL in an incognito browser window while being connected through a mobile hotspot"
                }
            }
        },
        "license": {
            "name": "Determine license",
            "description": "The appropriate license has to be chosen.",
            "fields": {
                "ref": "responsible"
            }
        }
    },
    "processes": [
        {
            "id": "GuidoAA",
            "name": "Open Data Process Guide AA",
            "description": "The process of publishing Open Data in the Federal Foreign Office",
            "modules": [
                "describe-dataset",
                "data-upload"
            ]
        }
    ]
}
