{
    "specifications": {
        "ministry": "Auswärtiges Amt",
        "roles": {
            "datenschutzbeauftragter": {
                "label": "Rechtsabteilung",
                "article": "Die",
                "email": "Gast@opendataprocess.onmicrosoft.com"
            },
            "pressereferat": {
                "label": "Pressereferat",
                "article": "Das",
                "email": "Gast@opendataprocess.onmicrosoft.com"
            }
        }
    },
    "fields": {
        "responsible": {
            "label": "Person responsible",
            "type": "textfield",
            "info": ""
        }
    },
    "modules": {
        "describe-dataset": {
            "name": "Datensatz beschreiben",
            "description": "Zum Start einer neuen Bereitstellung geben Sie dem Datensatz einen treffenden Titel und eine beschreiben Sie den Inhalt in kurzen und prägnant. Laden Sie im nächsten Schritt die einzelnen Dateien, die zum Datensatz gehören, hoch und beschreiben diese.",
            "fields": {
                "title": {
                    "label": "Titel",
                    "type": "textfield",
                    "placeholder": "z. B. Protokolldaten 2020",
                    "info": "Bitte geben Sie hier den Titel des Datensatzes ein. Dieser sollte eindeutig sein und klar auf den Inhalt hinweisen.",
                    "mandatory": true
                },
                "description": {
                    "label": "Beschreibung",
                    "type": "multitextfield",
                    "placeholder": "Beschreiben Sie kurz den Inhalt des Datensatzes.",
                    "info": "Bitte beschreiben Sie in diesem Feld den Inhalt des Datensatz möglichst prägnant.",
                    "mandatory": true
                },
                "data-provider": {
                    "label": "Datenbereitsteller",
                    "type": "textfield",
                    "prefill": "$specifications.ministry",
                    "info": "Dieses Feld dürfte mit dem Namen des übergeordneten Ministeriums vorausgefüllt sein und ist somit nicht änderbar. Dieses hängt mit der Vergabe des GovData-Zugangs zusammen.",
                    "mandatory": true
                },
                "categories": {
                    "label": "Kategorien",
                    "type": "multi-select-checkboxes",
                    "options": [
                        "Bevölkerung und Gesellschaft", "Bildung, Kultur und Sport", "Energie", "Gesundheit",
                        "Internationale Themen", "Verkehr", "Landwirtschaft, Fischerei, Forstwirtschaft & Nahrungsmittel",
                        "Regierung und öffentlicher Sektor", "Regionen und Städte", "Umwelt", "Wissenschaft und Technologie",
                        "Wirtschaft und Finanzen", "Justiz, Rechtssystem und öffentliche Sicherheit"
                    ],
                    "info": "Wählen Sie hier bitte eine oder mehrere Kategorien aus, die dem Inhalt Ihres Datensatzes am nächsten kommen. Handelt es sich um bspw. Daten der Gesundheitsfürsorge in Deutschland wählen Sie bitte die Kategorie „Gesundheit“."
                },
                "tags": {
                    "label": "Schlagwörter",
                    "type": "tag-creator",
                    "placeholder": "Mit welchen Wörter würde man nach dem Datensatz suchen?",
                    "info": "Hier sollten Schlagworte, Schlüsselbegriffe oder synonyme Begriffe gepflegt werden. Eine gewissenhafte Verschlagwortung ermöglicht es Nutzern Daten schneller und gezielter zu finden. Nutzen Sie Schlagwörter, um den Inhalt des bereitgestellten Datensatzes möglichst genau zu beschreiben. Dabei ist es empfehlenswert, auch den Titel der Ressource (bzw. die charakteristischen Bestandteile daraus) zusätzlich als Schlüsselwort zu erfassen.<br><br>Synonyme sollten ebenfalls als Schlagwort hinterlegt sein, um die bereitgestellten Daten einem möglichst großen Publikum zugänglich zu machen.<br><br>Beispiele:<br>1. Für Kindertagesstätte wären als Schlagworte denkbar: Kita, Hort, Kinderladen, Kinderhort uvm.<br>2. Eine Suche wird nach allgemeinen Verkehrsdaten gestartet mit dem Oberbegriff „Verkehr“. Ohne eine entsprechende Verschlagwortung könnten hier die Ergebnisse nicht eindeutig oder unvollständig ausfallen."
                }
            }
        },
        "data-upload": {
            "name": "Dateien hochladen",
            "description": "Sie haben den Datensatz in Schritt 1 beschrieben. Auf dieser Seite können Sie nun die dazugehörigen einzelnen Dateien hochladen und nähere Informationen dazu angeben. Die an dieser stelle hochgeladenen Daten werden nur intern in SharePoint gespeichert. Sie sind nicht öffentlich einsehbar und werden einer erneuten Prüfung unterzogen.",
            "fields": {
                "uploader": {
                    "label": "Hochladen der einzelnen Ressourcen (Daten)",
                    "type": "upload-files",
                    "placeholder": "Ziehen Sie die Daten einfach von Ihrem Rechner in dieses Feld oder klicken Sie auf den Button:",
                    "info": "Ziehen Sie die Daten von ihrem Desktop einfach per Drag & Drop in dieses Feld um die Daten hochzuladen.<br>Folgende Formate sind zurzeit für Open Data am besten geeignet:<br>• XML, RDF, CSV, JSON, RDF, HTML<br>Bitte exportieren sie die Datei nach Möglichkeit in eins oder mehrere dieser Dateiformaten und fügen Sie diese Dateien dem Upload hinzu.",
                    "mandatory": true
                }
            }
        },
        "supplement-metadata": {
            "name": "Zusätzliche Metadaten ergänzen",
            "description": "Der Datensatz ist beschrieben und die Dateien wurden hochgeladen. In diesem Schritt werden weitere Informationen zum Datensatz ergänzt. Durch diese Informationen ist der Datensatz für Suchmaschinen leichter zu finden und sie erleichtern dem Datenanwender die Arbeit mit dem Datensatz.",
            "fields": {
                "website": {
                    "label": "Webseite",
                    "type": "textfield",
                    "placeholder": "https://www.beispiel.de/suchen/details/",
                    "info": "Hier kann die Webseite verlinkt werden, die weitere Informationen zu dem Datensatz beinhaltet. Bitte verlinken Sie nicht die Ressource des Datensatzes<br>an dieser Stelle. Der Nutzer findet über den Link „Klicken Sie hier für weitere Informationen“ zu dieser Webpage. z. Bsp. https://www.govdata.de/web/guest/suchen/-/details/verbreitung-des-regelmassigen-alkoholkonsums-beijugendlichen-und-jungen-erwachsenen-in-de2012 https://www.bzga.de/forschung/studienuntersuchungen/studien/suchtpraevention/"
                },
                "quality-uri": {
                    "label": "Qualitätssicherungsprozess URI",
                    "type": "textfield",
                    "placeholder": "URI",
                    "info": "Ein URI, die auf den Prozess zur Qualitätssicherung der Datenstrukturen verweist. Es handelt sich idealerweise um den URL einer Webseite. Wenn die Datei bspw. entsprechend einem Standard (ISO, etc.) entspricht. Liegt diese Grundlage nicht vor, bleibt das Feld leer."
                },
                "time-reference": {
                    "label": "Zeitbezug von|Zeitbezug bis",
                    "type": "day-picker-from-to",
                    "placeholder": "TT-MM-JJJJ",
                    "info": "Haben die Informationen des Datensatzes eine zeitliche Abdeckung, sollte dies auch für den Nutzer kenntlich gemacht werden. Diese Information ermöglicht einem möglichen Nutzer eine spezifischere Suche bzw. eine spezifischere Abfrage der Daten. Beziehen sich die Daten z.B. auf einen Zeitraum von 01.2010 - 01.2015, dann sollte dieser Zeitraum hier auch gepflegt werden."
                },
                "geopol-coverage": {
                    "label": "Geopolitische Abdeckung URI",
                    "type": "textfield",
                    "placeholder": "-",
                    "info": "Diese Eigenschaft verknüpft eine Datenstruktur mit dem von ihr abgedecktem administrativem Gebiet der Bundesrepublik Deutschland. Dies kann etwa ein konkretes Bundesland, eine Kommune oder ein Landkreis sein, der durch ein URI repräsentiert wird.\nFür die Referenzierung der Bundesländer sollen Schlüssel im Namensraum http://dcat-ap.de/def/politicalGeocoding/stateKey/ genutzt werden.\nFür die Angabe von Gemeinden und Kommunen soll der Regionalschlüssel im Namensraum, http://dcat-ap.de/def/politicalGeocoding/regionalKey/ für die Angabe von Landkreisen der Kreisschlüssel aus dem Namensraum http://dcat-ap.de/def/politicalGeocoding/districtKey/ verwendet werden.\nFür die Bundesebene gibt es keine URI, so dass dieses Feld bei Bundesbehörden frei bleibt. In diesem Fall wählen Sie bitte unter „Ebene der geopolitischen Abdeckung URI“ (siehe Feld 8) den Eintrag „federal“ aus."
                },
                "legal-basis-for-access": {
                    "label": "Rechtsgrundlage für Zugangseröffnung",
                    "type": "textfield",
                    "placeholder": "-",
                    "info": "Wenn die Veröffentlichung aufgrund einer Rechtsgrundlage wie Transparenz-oder Open-Data-Gesetz erfolgt, kann dies hier angegeben werden. Ansonsten bleibt das Feld frei."
                },
                "level-geopol-coverage": {
                    "label": "Ebene der geopolitischen Abdeckung URI\t",
                    "type": "select-dropdown",
                    "defaultIndex": 0,
                    "options": ["Keine Angabe", "(international) internationale Ebene", "(european) EU-Ebene", "(federal) Bundesebene", "(state) Ebene der Länder", "(administrativedistrict) Ebene der Landkreise", "(municipality) kommunale Ebene"],
                    "info": "Wählen Sie hier aus, ob die Daten administrativ zur Ebene Bund, Bundesland, Kreis oder Kommune Bezug haben. Wenn Sie nicht die Ebene Bund wählen, sollte eine Ergänzung in „Geopolitische Abdeckung URI“ (siehe Feld 7) erfolgen.\nBei Bundesbehörden wird die Abdeckung in der Regel dem bundesweiten Bezug entsprechen. Wählen Sie daher „federal“ aus."
                },
                "coverage-text": {
                    "label": "Abdeckung Text",
                    "type": "textfield",
                    "placeholder": "-",
                    "info": "Wenn der räumliche Bezug nicht durch einen URI angegeben werden kann, bietet dieses Feld die Möglichkeit, die geopolitische Abdeckung als Freitext anzugeben. Ergänzend als Text bzw. alleinstehend für alle Fälle bei denen die geopolitische Abdeckung nicht durch einen URI angegeben werden kann (z.B. bei komplexeren Bund-Länder-Kooperationen oder auf kommunaler Ebene). \nDiese Eigenschaft kann für parallele Sprachversionen wiederholt werden, falls die Daten der Datei in verschiedenen Sprachen bereitgestellt werden. \nDeckt der Inhalt der Datei keine komplexe Kooperation ab bspw. bleibt dieses Feld leer."
                },
                "spatial-ref": {
                    "label": "Raumbezug",
                    "type": "multitextfieldlong",
                    "placeholder": "{\n  „type“: „Polygon“,\n  „coordinates“: [\n    [\n      [11.598079, 51.29537],\n      [11.598079, 53.89386],\n      [6.654667, 53.89386],\n      [6.654667, 51.29537],\n      [11.598079, 51.29537]\n    ]\n  ]\n}",
                    "info": "Dieses Feld bezieht sich auf eine geographische Region, welche durch den Datensatz abgedeckt wird. Bitte verwenden Sie hierfür das GeoJSON-Schema, wie es im Beispiel dargestellt ist.\nMit Geojson.io kann das aktuelle Polygon bearbeitet oder ein neues erzeugt werden.\n\n"
                }
            }
        },
        "check-legal-constraints": {
            "name": "Rechtliche Einschränkungen prüfen",
            "description": "Überprüfen Sie den Datensatz auf rechtlichen Einschränkungen. Das untenstehende Formular gibt Ihnen dabei zusätzliche Informationen und Hilfestellungen. Bitte lesen Sie sich die Informationen sorgfältig durch.",
            "responsible": "datenschutzbeauftragter",
            "fields": {
                "data-sighted-label": {
                    "label": "Daten gesichtet?",
                    "type": "label-only"
                },
                "data-sighted": {
                    "label": "Ja, ich habe die Daten gesichtet.",
                    "type": "checkbox",
                    "info": "Warum muss ich die Daten sichten? Um die folgenden Fragen richtig beurteilen zu können, brauchen Sie eine Einsicht in den Datensatz. \nDie Metadaten bzw. Informationen zu dem Datensatz reichen hierfür nicht aus, da es teilweise explizit den Inhalt des Datensatzes betrifft."
                },
                "open-data-criteria-fulfilled-label": {
                    "label": "Sind die Open-Data-Kriterien erfüllt? (EGovG)",
                    "type": "label-only"
                },
                "open-data-criteria-fulfilled": {
                    "label": "Der Datensatz erfüllt die Open-Data-Kriterien.",
                    "type": "checkbox",
                    "info": "Was sind die Kriterien, nach denen Daten \nveröffentlicht werden müssen? Die gesetzliche Pflicht zur Veröffentlichung von Daten nach § 12a EGovernment-Gesetz gilt für Daten, die folgende Kriterien erfüllen:\n\n• sie müssen unbearbeitet sein\n• sie sind elektronisch gespeichert\n• beinhalten nur Tatsachen die außerhalb der Behörde liegende Verhältnisse betreffen\n• sie sind nicht Ergebnis einer Bearbeitung anderer Daten durch eine Behörde der unmittelbaren Bundesverwaltung. (Siehe dazu den ersten Punkt)\n• sind nicht für Forschungszwecke erhoben worden\n• kein oder lediglich ein eingeschränktes Zugangsrecht insbesondere nach §§ 3-6 IFG besteht\noder\n• ein Zugangsrecht erst nach der Beteiligung Dritter bestünde\n• die Daten ohne Auftrag der Behörde von Dritten erstellt und ihr ohne rechtliche Verpflichtung übermittelt werden\n• die Daten bereits über öffentlich zugänglich Netze entgeltfrei bereitgestellt werden."
                },
                "provision-complies-legal-requirements-label": {
                    "label": "Entspricht die Bereitstellung den gesetzlichen Auflagen?",
                    "type": "label-only"
                },
                "provision-complies-legal-requirements-1": {
                    "label": "Auf Datenschutz geprüft (BDSG)",
                    "type": "checkbox",
                    "info": "Wie erkenne ich personenbezogene Daten? Es handelt sich um personenbezogene Daten, sobald durch Angaben im Datensatz ein Rückschluss auf eine Person gezogen werden kann. Enthält Ihr Datensatz folgende Angaben, ist er für eine Veröffentlichung vorerst nicht geeignet. \n\n• Namen\n• Telefonnummern \n• Geburtsdaten\n• Familiennamen mit Ortsangabe\n\nAb hier besteht die Möglichkeit, die Angaben manuell zu entfernen oder durch unser Anonymisierungstool zu schwärzen.\n\nSollten Sie sich dennoch unsicher sein, kontaktieren Sie die zuständige Stelle in Ihrer Behörde.\nDatenschutzbeauftragter Auswärtiges Amt: \nHerr Max Mustermann (1234@diplo.de)"
                },
                "provision-complies-legal-requirements-2": {
                    "label": "Auf Urheberschutzrecht geprüft (UrhG)",
                    "type": "checkbox",
                    "info": "Wie kann ich herausfinden, ob der Datensatz \ndurch das Urheberrecht eingeschränkt ist? Wenn es der*die Urheber*in wünscht, kann das Werk mit einer Urheberbezeichnung versehen werden (§ 13 UrhG). Bearbeitungen oder andere Umgestaltungen des Werkes dürfen nur mit Einwilligung der schöpfenden Person des bearbeiteten oder umgestalteten Werkes veröffentlicht oder verwertet werden (§ 23 UrhG). Allerdings kann ein Nutzungsrecht, welches in irgendeiner Weise beschränkt sein kann, eingeräumt werden (§ 31 UrhG). Wie kann ich herausfinden, wer der Urheber ist? Als Urheber*in eines Werkes sieht das Gesetz den*die Schöpfer*in (§ 7 UrhG). Nur diese Person kann entscheiden, wann und wie das Werk verbreitet wird und ob es vervielfältigt werden darf (§ 17 UrhG). (…CCOD fragen?) Ausnahmen: Amtliche Erlasse, Verordnungen oder Gesetzte sowie Entscheidungen und amtlich verfasste Leitsätze zu  Entscheidungen genießen hingegen keinen urheberrechtlichen Schutz (§ 5 Abs. 1 UrhG). Das gleiche gilt für andere amtliche Werke, die im amtlichen Interesse zur allgemeinen Kenntnisnahme veröffentlicht werden."
                },
                "provision-complies-legal-requirements-3": {
                    "label": "Auf Schutz durch das IFG geprüft (§§ 3-6 IFG)",
                    "type": "checkbox",
                    "info": "Wann sind Daten durch das IFG geschützt? Das Informationsfreiheitsgesetz IFG regelt den Zugang zu amtlichen Informationen durch Jedermann und begründet ein Auskunftsrecht oder die Akteneinsicht. Dieses Ansinnen kann nur aus wichtigem Grund abgelehnt werden. § 12a EGovG bezieht sich bei den Ausnahmetatbeständen, die einer Veröffentlichung von Daten entgegenstehen, auf die §§ 3-6 IFG.\n\nSchutz bei:\n• behördlicher Entscheidungsprozesse (§ 4 IFG)\n• personenbezogener Daten (§ 5 IFG)\n• geistigem Eigentum sowie Betriebs- und\n  Geschäftsgeheimnissen (§ 6 IFG)"
                },
                "license-terms-coverage-label": {
                    "label": "Bildet die ausgewählte Lizenz die \nNutzungsbedingungen ab?",
                    "type": "label-only",
                    "info": "Was sind gängige Lizenzen und wie stell ich sicher, dass ich die Richtige für den Datensatz gewählt habe? Um den Aufwand zu minimieren empfiehlt es sich auf bestehende und vorgefertigte Lizenzmodelle zurückzugreifen. Zwei, für Open Data geeignete, Lizenzen sind die auf den deutschen Rechtsraum angepasste Datenlizenz Deutschland 2.0 und die international bekannte Creative Commons Lizenz 4.03"
                },
                "chosen-license": {
                    "label": "Aktuell gewählte Lizenz:",
                    "type": "select-dropdown",
                    "defaultIndex": 12,
                    "options": ["Amtliches Werk, lizenzfrei nach §5 Abs. 1 UrhG","Amtliches Werk, lizenzfrei nach §5 Abs. 1 UrhG (ältere DCAT-AP.de Version)","Andere Freeware Lizenz","Andere geschlossene Lizenz","Andere kommerzielle Lizenz","Andere offene Lizenz","Andere Open Source Lizenz","BSD Lizenz","Creative Commons Attribution ShareAlike 4.0 (CCBYSA4.0) (ältere DCAT-AP.de Version)","Creative Commons CC Zero License (cc-zero)","Creative Commons Namensnennung (CC-BY)","Creative Commons Namensnennung 3.0 (CC-BY) (ältere DCAT-AP.de Version)","Creative Commons Namensnennung 3.0 Deutschland (CC BY 3.0 DE)","Creative Commons Namensnennung 4.0 (CCBY) (ältere DCAT-AP.de Version)","Creative Commons Namensnennung – 4.0 International (CC BY 4.0)","Creative Commons Namensnennung - Keine Bearbeitung (CC BY-ND)","Creative Commons Namensnennung Keine Bearbeitung 3.0 (CC-BY-ND) (ältere DCAT-AP.de Version)","Creative Commons Namensnennung -- Keine Bearbeitung 3.0 Unported (CC BY-ND 3.0)","Creative Commons Namensnennung - - Keine Bearbeitung 4.0 International (CC BY-ND 4.0)","Creative Commons Namensnennung Keine Bearbeitung 4.0 International (CC BYND 4.0) (ältere DCAT-AP.de Version)","Creative Commons Namensnennung-Nicht kommerziell (ältere DCAT-AP.de Version)","Creative Commons Namensnennung - Nicht kommerziell (CC BY-NC)","Creative Commons Namensnennung-Nicht kommerziell 3.0 (ältere DCAT-AP.de Version)","Creative Commons Namensnennung-Nicht kommerziell 3.0 Deutschland (CC BY-NC 3.0 DE)","Creative Commons Namensnennung Nichtkommerziell 4.0 (CCBY) (ältere DCAT-AP.de Version)","Creative Commons Namensnennung - Nicht kommerziell 4.0 International (CC BY-NC 4.0)","Creative Commons Namensnennung - Weitergabe unter gleichen Bedingungen (CC-BY-SA)","Creative Commons Namensnennung - Weitergabe unter gleichen Bedingungen 3.0 Deutschland (CC BY-SA 3.0 DE)","Creative Commons Namensnennung - Weitergabe unter gleichen Bedingungen 4.0 International (CC-BY-SA 4.0)","Datenlizenz Deutschland Namensnennung 1.0","Datenlizenz Deutschland Namensnennung 1.0 (ältere DCAT-AP.de Version)","Datenlizenz Deutschland Namensnennung 2.0","Datenlizenz Deutschland Namensnennung 2.0 (ältere DCAT-AP.de Version)","Datenlizenz Deutschland Namensnennung nicht-kommerziell 1.0","Datenlizenz Deutschland Namensnennung nicht-kommerziell 1.0 (ältere DCAT-AP.de Version)","Datenlizenz Deutschland – Zero – Version 2.0","Datenlizenz Deutschland – Zero – Version 2.0 (ältere DCAT-AP.de Version)","Freie Softwarelizenz der Apache Software Foundation","GNU Free Documentation License (GFDL)","GNU General Public License version 3.0 (GPLv3)","GNU General Public License version 3.0 (GPLv3) (ältere DCAT-AP.de Version)","Mozilla Public License 2.0 (MPL)","Nutzungsbestimmungen für die Bereitstellung von Geodaten des Bundes","Nutzungsbestimmungen für die Bereitstellung von Geodaten des Landes Berlin","Open Data Commons Attribution License (ODCBY) (ältere DCAT-AP.de Version)","Open Data Commons Attribution License (ODC-BY 1.0)","Open Data Commons Open Database License (ODbL)","Open Data Commons Open Database License (ODbL) (ältere DCAT-AP.de Version)","Open Data Commons Public Domain Dedication and Licence (ODC PDDL)","Open Data Commons Public Domain Dedication and Licence (PDDL) (ältere DCAT-AP.de Version)","Public Domain Mark 1.0 (PDM)","Public Domain Mark 1.0 (PDM) (ältere DCAT-AP.de Version)"],
                },
                "chosen-license-confirm": {
                    "label": "Ja|Nein",
                    "type": "radiobox-group-two"
                }
            },
            "task-bottom-text": "Mit der Freigabe leiten Sie die Bereitstellung in den nächsten Schritt zur Veröffentlichung."
        },
        "confirm-publication": {
            "name": "Veröffentlichung des Datensatzes bestätigen",
            "description": "In den vorherigen Schritten wurde der Datensatz angelegt und überprüft. Bestätigen Sie in diesem Schritt die Veröffentlichung des Datensatzes. Dieser Schritt kann bearbeitet werden, sobald die Daten auf der Homepage Ihres Ministerium veröffentlicht wurden. Geben sie im unten stehenden Formular die URL an, unter der der Datensatz auffindbar ist. Bitte ergänzen Sie ebenfalls die URLs der zum Datensatz gehörenden Ressourcen, sowie das Datum der Veröffentlichung.",
            "responsible": "pressereferat",
            "fields": {
                "published-on-website-label": {
                    "label": "Auf Website veröffentlicht?",
                    "type": "label-only",
                    "info": "Wie veröffentliche ich Daten? Um den Datensatz zu veröffentlichen brauchen Sie eine Website, auf der die Datenveröffentlicht werden können, meistens handelt es sich hier um die Website Ihres Ministeriums. Je nach dem, wie die Seite aufgebaut ist, muss der Datensatz in das bestehende Content Management System der Seite hochgeladen werden. \nHierzu kontaktieren Sie entweder Ihren Internetseiten-Anbieter oder die Pressestelle Ihrer Behörde."
                },
                "url-of-dataset": {
                    "label": "URL des Datensatzes",
                    "type": "textfield",
                    "placeholder": "https://www.auswaertiges-amt.de/suchen/-/details/datensatz",
                    "mandatory": true
                }
            },
            "task-bottom-text": "Mit der Freigabe leiten Sie die Bereitstellung in den nächsten Schritt zur Metadatenerfassung."
        },
        "check-and-complete-metadata": {
            "name": "Prüfung und Ergänzung der Metadaten",
            "description": "Prüfen und ergänzen Sie die Felder im unterstehenden Formular, um die zum Datensatz gehörenden Metadaten vollständig zu erfassen. Anschließend werden diese an GovData weitergeleitet und sind dort für die Datennutzer:innen Metadatenkatalog auffindbar. Ergänzen Sie im unten stehenden Formular leere Felder und bestätigen Sie abschließend die Freigabe der Metadaten.",
            "fields": {},
            "task-bottom-text": "Mit der finalen Freigabe ist die Bereitstellung des Datensatzes abgeschlossen."
        },
        "prepare-data": {
            "name": "Prepare Data",
            "description": "Check if the data meets the standards for open publication, e.g. spell out internal abbreviations",
            "fields": {
                "preparedness": {
                    "label": "Is the data prepared?",
                    "type": "checkbox",
                    "info": ""
                }
            }
        },
        "publish-data": {
            "name": "Publish Data",
            "description": "The data needs to be permanently and publicly accessible via an URL",
            "fields": {
                "ref": "responsible",
                "url": {
                    "label": "URL to published data",
                    "type": "textfield",
                    "info": ""
                },
                "url-accessibility": {
                    "label": "Is the URL publicly accessible?",
                    "type": "checkbox",
                    "info": "If unsure, see if you can download it when opening the URL in an incognito browser window while being connected through a mobile hotspot"
                }
            }
        },
        "license": {
            "name": "Determine license",
            "description": "The appropriate license has to be chosen.",
            "fields": {
                "ref": "responsible"
            }
        }
    },
    "processes": [
        {
            "id": "GuidoDev",
            "name": "Testprozess",
            "description": "",
            "modules": [
                "describe-dataset",
                "data-upload",
                "supplement-metadata",
                "check-legal-constraints",
                "confirm-publication",
                "check-and-complete-metadata"
            ]
        }
    ]
}
